//TODO /**describe('template spec', () => { ... }) */
/**
 *?این یک بلوک توصیف تست هست که معمولاً برای گروه‌بندی تست‌ها استفاده می‌شه.
  //?template spec' عنوان این گروه تست هست. می‌تونی هر اسمی بزاری، مثلاً 'صفحه اصلی'.
✅ //? نت: گروه تستی به نام template spec تعریف شده که شامل یک تست برای بررسی صفحه است.
* //!---------------------------------------------------------------------------------------
 * TODO it('passes', () => { ... }) 
 * ?یک تست با عنوان passes تعریف شده که یک شرط مشخص رو بررسی می‌کنه.
 * //!--------------------------------------------------------------------------
 * 
 * TODO cy.visit('http://localhost:5173/');
 * ? این خط باعث می‌شه Cypress به این URL بره.
 * ?    به این صفحه هدایت میشه Cypress  صفحه لوکال هاست با پرت 5137 روبازمیکنه و در واقع  Cypress یعنی مرورگر مجازی 
 * //!---------------------------------------------------------------------------------------------------------------------
 * 
 *  TODO cy.get('h1').should('have.length', 1);
 * ?    را در صفحه پیدا میکند cy.get('h1')  ابتدا المنت 
 * ?    وجد دارد یا خیر h1 سپس برسی میکند ایا فقط یک تگ 
 * //!--------------------------------------------------------
 * 
 * 
 */

describe('template spec', () => {
  it('passes', () => {
    cy.visit('http://localhost:5173/');
    cy.get('h1').should('have.length', 1);
  });
});
